src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/CommonModules/УЗ_ЗарплатаУрока/Ext/Module.bsl
//Зарплата педагога в уроке и ставки — только руководителю (R24 ревью 28.09, как в типовых: сдельный наряд
//закрывает мастер, начисление считает программа по ставке, ставку назначает руководитель).
//
//Урок начисление педагогу не хранит: проведение считает его по ставке урока (Документы.УЗ_Урок.НачисленияПоСтавке)
//и пишет сразу в регистр УЗ_РасчетыПоЗарплате, который менеджер пишет, но прочитать не может. Доплаты сверх ставки —
//документ «Начисление педагогам» на основании урока, он менеджеру не виден и не доступен для записи.
//Остаётся одно, чем менеджер мог бы повлиять на зарплату, — выбор ставки: в уроке, в карточке педагога и в группе.
//Права на реквизит «Ставка педагога» (без «Редактирование») — интерфейсные: форма, список, настройки. Запись из кода
//(обработки, внешнее соединение) они не останавливают, поэтому здесь — проверка на сервере по данным в базе.
//У кого зарплата доступна (УЗ_Общий.ДоступнаЗарплата — руководитель, администратор), проверки не действуют.

//Обработчик подписки УЗ_ЗарплатаУрокаПередЗаписью (после ПередЗаписью модуля урока: ставка уже подставлена).
//Новый урок — ставка по умолчанию (группы урока, иначе педагога): другую ставку менеджера, в том числе
//скопированную из урока-образца, код заменяет с сообщением. Записанный урок — ставку оставить прежней; при смене
//педагога или группы — ставка по умолчанию для них (так делает форма). Иначе — отказ.
Процедура ПередЗаписьюУрока(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Или УЗ_Общий.ДоступнаЗарплата() Тогда
		Возврат;
	КонецЕсли;

	ПоУмолчанию = Документы.УЗ_Урок.СтавкаПедагогаПоУмолчанию(Источник.Педагог, Источник.ГруппаОбучения);
	Если Источник.ЭтоНовый() Тогда
		Если Источник.СтавкаПедагога <> ПоУмолчанию Тогда
			Источник.СтавкаПедагога = ПоУмолчанию;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр(
				"ru = 'Ставка педагога в новом уроке — по умолчанию (группы урока, иначе карточки педагога): другую "
				+ "ставку выбирает руководитель.'");
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Прежний = УрокВБазе(Источник.Ссылка);
	Если Источник.СтавкаПедагога = Прежний.СтавкаПедагога Тогда
		Возврат;
	КонецЕсли;
	ПедагогИлиГруппаСменились = Источник.Педагог <> Прежний.Педагог
		Или Источник.ГруппаОбучения <> Прежний.ГруппаОбучения;
	Если ПедагогИлиГруппаСменились И Источник.СтавкаПедагога = ПоУмолчанию Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Ставку педагога в уроке меняет руководитель: у вас нет доступа к зарплате.'");
	Сообщение.Сообщить();

КонецПроцедуры

//Из ПередЗаписью карточки педагога (Справочник.УЗ_ФизЛица) и группы (Справочник.УЗ_ГруппыОбучения): ставку
//назначает и меняет руководитель. Менеджер заводит педагога и группу без ставки или с прежней ставкой.
Процедура ПроверитьСтавкуСправочника(Объект, Отказ) Экспорт

	Если Объект.ОбменДанными.Загрузка Или Объект.ЭтоГруппа Или УЗ_Общий.ДоступнаЗарплата() Тогда
		Возврат;
	КонецЕсли;
	Прежняя = ?(Объект.ЭтоНовый(), Справочники.УЗ_СтавкиПедагогов.ПустаяСсылка(), Объект.Ссылка.СтавкаПедагога);
	Если Объект.СтавкаПедагога = Прежняя Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрШаблон(НСтр(
		"ru = '%1: ставку педагога назначает и меняет руководитель — у вас нет доступа к зарплате.'"), Объект);
	Сообщение.Поле = "СтавкаПедагога";
	Сообщение.Сообщить();

КонецПроцедуры

//Педагог, группа и ставка урока в базе.
Функция УрокВБазе(Ссылка)

	Итог = Новый Структура("Педагог, ГруппаОбучения, СтавкаПедагога");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Урок.Педагог КАК Педагог,
	|	Урок.ГруппаОбучения КАК ГруппаОбучения,
	|	Урок.СтавкаПедагога КАК СтавкаПедагога
	|ИЗ
	|	Документ.УЗ_Урок КАК Урок
	|ГДЕ
	|	Урок.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Итог, Выборка);
	КонецЕсли;
	Возврат Итог;

КонецФункции
